nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/ports/processor/ports_p32mk1024mcf100.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _PORTS_P32MK1024MCF100_H
#define _PORTS_P32MK1024MCF100_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    PORTS_ID_0 = 0,
    PORTS_NUMBER_OF_MODULES = 1

} PORTS_MODULE_ID;

typedef enum {

    PORTS_PIN_MODE_ANALOG = 0,
    PORTS_PIN_MODE_DIGITAL = 1

} PORTS_PIN_MODE;

typedef enum {

    PORTS_CHANGE_NOTICE_PIN_NONE

} PORTS_CHANGE_NOTICE_PIN;

typedef enum {

    PORTS_CN_PIN_NONE

} PORTS_CN_PIN;

typedef enum {

    PORTS_ANALOG_PIN_0 = 0,
    PORTS_ANALOG_PIN_1 = 1,
    PORTS_ANALOG_PIN_2 = 16,
    PORTS_ANALOG_PIN_3 = 17,
    PORTS_ANALOG_PIN_4 = 18,
    PORTS_ANALOG_PIN_5 = 19,
    PORTS_ANALOG_PIN_6 = 32,
    PORTS_ANALOG_PIN_7 = 33,
    PORTS_ANALOG_PIN_8 = 34,
    PORTS_ANALOG_PIN_9 = 11,
    PORTS_ANALOG_PIN_10 = 12,
    PORTS_ANALOG_PIN_11 = 43,
    PORTS_ANALOG_PIN_12 = 76,
    PORTS_ANALOG_PIN_13 = 77,
    PORTS_ANALOG_PIN_14 = 78,
    PORTS_ANALOG_PIN_15 = 79,
    PORTS_ANALOG_PIN_16 = 105,
    PORTS_ANALOG_PIN_17 = 104,
    PORTS_ANALOG_PIN_18 = 103,
    PORTS_ANALOG_PIN_19 = 102,
    PORTS_ANALOG_PIN_20 = 73,
    PORTS_ANALOG_PIN_21 = 72,
    PORTS_ANALOG_PIN_22 = 106,
    PORTS_ANALOG_PIN_23 = 111,
    PORTS_ANALOG_PIN_24 = 4,
    PORTS_ANALOG_PIN_25 = 23,
    PORTS_ANALOG_PIN_26 = 8,
    PORTS_ANALOG_PIN_27 = 25,
    PORTS_ANALOG_PIN_33 = 89,
    PORTS_ANALOG_PIN_34 = 90,
    PORTS_ANALOG_PIN_35 = 107,
    PORTS_ANALOG_PIN_36 = 93,
    PORTS_ANALOG_PIN_37 = 92,
    PORTS_ANALOG_PIN_38 = 62,
    PORTS_ANALOG_PIN_39 = 63,
    PORTS_ANALOG_PIN_40 = 64,
    PORTS_ANALOG_PIN_41 = 65,
    PORTS_ANALOG_PIN_45 = 85,
    PORTS_ANALOG_PIN_46 = 14,
    PORTS_ANALOG_PIN_47 = 15,
    PORTS_ANALOG_PIN_48 = 42,
    PORTS_ANALOG_PIN_49 = 44

} PORTS_ANALOG_PIN;

typedef enum {

    PORTS_AN_PIN_NONE

} PORTS_AN_PIN;

typedef enum {

    PORTS_BIT_POS_0 = 0,
    PORTS_BIT_POS_1 = 1,
    PORTS_BIT_POS_2 = 2,
    PORTS_BIT_POS_3 = 3,
    PORTS_BIT_POS_4 = 4,
    PORTS_BIT_POS_5 = 5,
    PORTS_BIT_POS_6 = 6,
    PORTS_BIT_POS_7 = 7,
    PORTS_BIT_POS_8 = 8,
    PORTS_BIT_POS_9 = 9,
    PORTS_BIT_POS_10 = 10,
    PORTS_BIT_POS_11 = 11,
    PORTS_BIT_POS_12 = 12,
    PORTS_BIT_POS_13 = 13,
    PORTS_BIT_POS_14 = 14,
    PORTS_BIT_POS_15 = 15

} PORTS_BIT_POS;

typedef enum {

    INPUT_FUNC_INT1 = 0,
    INPUT_FUNC_INT2 = 1,
    INPUT_FUNC_INT3 = 2,
    INPUT_FUNC_INT4 = 3,
    INPUT_FUNC_T2CK = 5,
    INPUT_FUNC_T3CK = 6,
    INPUT_FUNC_T4CK = 7,
    INPUT_FUNC_T5CK = 8,
    INPUT_FUNC_T6CK = 9,
    INPUT_FUNC_T7CK = 10,
    INPUT_FUNC_T8CK = 11,
    INPUT_FUNC_T9CK = 12,
    INPUT_FUNC_IC1 = 13,
    INPUT_FUNC_IC2 = 14,
    INPUT_FUNC_IC3 = 15,
    INPUT_FUNC_IC4 = 16,
    INPUT_FUNC_IC5 = 17,
    INPUT_FUNC_IC6 = 18,
    INPUT_FUNC_IC7 = 19,
    INPUT_FUNC_IC8 = 20,
    INPUT_FUNC_IC9 = 21,
    INPUT_FUNC_IC10 = 61,
    INPUT_FUNC_IC11 = 62,
    INPUT_FUNC_IC12 = 63,
    INPUT_FUNC_IC13 = 64,
    INPUT_FUNC_IC14 = 65,
    INPUT_FUNC_IC15 = 66,
    INPUT_FUNC_IC16 = 67,
    INPUT_FUNC_OCFA = 22,
    INPUT_FUNC_OCFB = 23,
    INPUT_FUNC_U1RX = 24,
    INPUT_FUNC_U1CTS = 25,
    INPUT_FUNC_U2RX = 26,
    INPUT_FUNC_U2CTS = 27,
    INPUT_FUNC_U3RX = 28,
    INPUT_FUNC_U3CTS = 29,
    INPUT_FUNC_U4RX = 30,
    INPUT_FUNC_U4CTS = 31,
    INPUT_FUNC_U5RX = 32,
    INPUT_FUNC_U5CTS = 33,
    INPUT_FUNC_U6RX = 34,
    INPUT_FUNC_U6CTS = 35,
    INPUT_FUNC_SDI1 = 37,
    INPUT_FUNC_SS1 = 38,
    INPUT_FUNC_SDI2 = 40,
    INPUT_FUNC_SS2 = 41,
    INPUT_FUNC_SCK3 = 42,
    INPUT_FUNC_SDI3 = 43,
    INPUT_FUNC_SS3 = 44,
    INPUT_FUNC_SCK4 = 45,
    INPUT_FUNC_SDI4 = 46,
    INPUT_FUNC_SS4 = 47,
    INPUT_FUNC_C1RX = 48,
    INPUT_FUNC_C2RX = 49,
    INPUT_FUNC_SCK5 = 68,
    INPUT_FUNC_SDI5 = 69,
    INPUT_FUNC_SS5 = 60,
    INPUT_FUNC_SCK6 = 71,
    INPUT_FUNC_SDI6 = 72,
    INPUT_FUNC_SS6 = 73,
    INPUT_FUNC_C3RX = 74,
    INPUT_FUNC_C4RX = 75,
    INPUT_FUNC_REFI = 50,
    INPUT_FUNC_QEA1 = 51,
    INPUT_FUNC_QEB1 = 52,
    INPUT_FUNC_INDX1 = 53,
    INPUT_FUNC_HOME1 = 54,
    INPUT_FUNC_QEA2 = 55,
    INPUT_FUNC_QEB2 = 56,
    INPUT_FUNC_INDX2 = 57,
    INPUT_FUNC_HOME2 = 58,
    INPUT_FUNC_QEA3 = 76,
    INPUT_FUNC_QEB3 = 77,
    INPUT_FUNC_INDX3 = 78,
    INPUT_FUNC_HOME3 = 79,
    INPUT_FUNC_QEA4 = 80,
    INPUT_FUNC_QEB4 = 81,
    INPUT_FUNC_INDX4 = 82,
    INPUT_FUNC_HOME4 = 83,
    INPUT_FUNC_QEA5 = 84,
    INPUT_FUNC_QEB5 = 85,
    INPUT_FUNC_INDX5 = 86,
    INPUT_FUNC_HOME5 = 87,
    INPUT_FUNC_QEA6 = 88,
    INPUT_FUNC_QEB6 = 89,
    INPUT_FUNC_INDX6 = 90,
    INPUT_FUNC_HOME6 = 91

} PORTS_REMAP_INPUT_FUNCTION;

typedef enum {

    INPUT_PIN_RPG8 = 0x0A,
    INPUT_PIN_RPF1 = 0x0B,
    INPUT_PIN_RPB9 = 0x04,
    INPUT_PIN_RPB10 = 0x03,
    INPUT_PIN_RPB5 = 0x01,
    INPUT_PIN_RPC1 = 0x06,
    INPUT_PIN_RPG1 = 0x0C,
    INPUT_PIN_RPA14 = 0x0D,
    INPUT_PIN_RPD6 = 0x09,
    INPUT_PIN_RPD3 = 0x0D,
    INPUT_PIN_RPG7 = 0x0A,
    INPUT_PIN_RPF0 = 0x0C,
    INPUT_PIN_RPB1 = 0x02,
    INPUT_PIN_RPC13 = 0x09,
    INPUT_PIN_RPB3 = 0x01,
    INPUT_PIN_RPG0 = 0x0B,
    INPUT_PIN_RPA15 = 0x0D,
    INPUT_PIN_RPG6 = 0x0A,
    INPUT_PIN_RPB8 = 0x04,
    INPUT_PIN_RPB15 = 0x03,
    INPUT_PIN_RPD4 = 0x0D,
    INPUT_PIN_RPB0 = 0x02,
    INPUT_PIN_RPB7 = 0x04,
    INPUT_PIN_RPG9 = 0x0A,
    INPUT_PIN_RPB14 = 0x00,
    INPUT_PIN_RPB6 = 0x00,
    INPUT_PIN_RPD5 = 0x09,
    INPUT_PIN_RPB2 = 0x04,
    INPUT_PIN_RPC2 = 0x06,
    INPUT_PIN_RPA0 = 0x00,
    INPUT_PIN_RPB4 = 0x02,
    INPUT_PIN_RPC7 = 0x05,
    INPUT_PIN_RPC0 = 0x06,
    INPUT_PIN_RPA1 = 0x00,
    INPUT_PIN_RPB11 = 0x03,
    INPUT_PIN_RPA8 = 0x05,
    INPUT_PIN_RPC8 = 0x06,
    INPUT_PIN_RPA4 = 0x02,
    INPUT_PIN_RPB13 = 0x03,
    INPUT_PIN_RPC6 = 0x05,
    INPUT_PIN_RPC9 = 0x05,
    INPUT_PIN_RPA7 = 0x07,
    INPUT_PIN_RPA11 = 0x08,
    INPUT_PIN_RPB12 = 0x07,
    INPUT_PIN_RPE0 = 0x0C,
    INPUT_PIN_RPA12 = 0x08,
    INPUT_PIN_RPE1 = 0x0C,
    INPUT_PIN_RPC15 = 0x01,
    INPUT_PIN_RPE14 = 0x08,
    INPUT_PIN_RPC12 = 0x01,
    INPUT_PIN_RPE15 = 0x08,
    INPUT_PIN_RPC10 = 0x09,
    INPUT_PIN_RPG12 = 0x0B

} PORTS_REMAP_INPUT_PIN;

