nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/ports/processor/ports_p32mk1024mcf100.h
typedef enum {

    OUTPUT_FUNC_U3TX = 0x01,
    OUTPUT_FUNC_U4RTS = 0x02,
    OUTPUT_FUNC_SDO1 = 0x03,
    OUTPUT_FUNC_SDO2 = 0x04,
    OUTPUT_FUNC_SDO3 = 0x0E,
    OUTPUT_FUNC_SDO5 = 0x10,
    OUTPUT_FUNC_SS6 = 0x11,
    OUTPUT_FUNC_OC3 = 0x05,
    OUTPUT_FUNC_OC6 = 0x06,
    OUTPUT_FUNC_REFCLKO4 = 0x12,
    OUTPUT_FUNC_C2OUT = 0x07,
    OUTPUT_FUNC_C1TX = 0x0C,
    OUTPUT_FUNC_U1TX = 0x01,
    OUTPUT_FUNC_U2RTS = 0x02,
    OUTPUT_FUNC_U5TX = 0x0B,
    OUTPUT_FUNC_U6RTS = 0x0B,
    OUTPUT_FUNC_SDO4 = 0x0F,
    OUTPUT_FUNC_OC4 = 0x05,
    OUTPUT_FUNC_OC7 = 0x06,
    OUTPUT_FUNC_REFCLKO1 = 0x07,
    OUTPUT_FUNC_U3RTS = 0x01,
    OUTPUT_FUNC_U4TX = 0x02,
    OUTPUT_FUNC_U6TX = 0x0B,
    OUTPUT_FUNC_SS1 = 0x03,
    OUTPUT_FUNC_SS3 = 0x0E,
    OUTPUT_FUNC_SS4 = 0x0F,
    OUTPUT_FUNC_SS5 = 0x10,
    OUTPUT_FUNC_SDO6 = 0x11,
    OUTPUT_FUNC_OC5 = 0x06,
    OUTPUT_FUNC_OC8 = 0x06,
    OUTPUT_FUNC_C1OUT = 0x07,
    OUTPUT_FUNC_REFCLKO3 = 0x12,
    OUTPUT_FUNC_U1RTS = 0x01,
    OUTPUT_FUNC_U2TX = 0x02,
    OUTPUT_FUNC_U5RTS = 0x0B,
    OUTPUT_FUNC_SS2 = 0x04,
    OUTPUT_FUNC_OC2 = 0x05,
    OUTPUT_FUNC_OC1 = 0x05,
    OUTPUT_FUNC_OC9 = 0x08,
    OUTPUT_FUNC_C2TX = 0x0C,
    OUTPUT_FUNC_C3OUT = 0x07,
    OUTPUT_FUNC_REFCLKO2 = 0x12,
    OUTPUT_FUNC_C4OUT = 0x08,
    OUTPUT_FUNC_OC13 = 0x09,
    OUTPUT_FUNC_SCK4 = 0x0F,
    OUTPUT_FUNC_OC12 = 0x09,
    OUTPUT_FUNC_OC16 = 0x0A,
    OUTPUT_FUNC_C4TX = 0x0C,
    OUTPUT_FUNC_SCK6 = 0x11,
    OUTPUT_FUNC_C5OUT = 0x08,
    OUTPUT_FUNC_OC10 = 0x09,
    OUTPUT_FUNC_OC14 = 0x0A,
    OUTPUT_FUNC_C3TX = 0x0C,
    OUTPUT_FUNC_OC11 = 0x09,
    OUTPUT_FUNC_OC15 = 0x0A,
    OUTPUT_FUNC_SCK3 = 0x0E,
    OUTPUT_FUNC_SCK5 = 0x10,
    OUTPUT_FUNC_CTPLS = 0x12,
    OUTPUT_FUNC_QEICMP1 = 0x14,
    OUTPUT_FUNC_QEICMP2 = 0x14,
    OUTPUT_FUNC_QEICMP3 = 0x14,
    OUTPUT_FUNC_QEICMP4 = 0x14,
    OUTPUT_FUNC_QEICMP5 = 0x15,
    OUTPUT_FUNC_QEICMP6 = 0x15

} PORTS_REMAP_OUTPUT_FUNCTION;

typedef enum {

    OUTPUT_PIN_RPA0 = 0,
    OUTPUT_PIN_RPA1 = 1,
    OUTPUT_PIN_RPA2 = 2,
    OUTPUT_PIN_RPA3 = 3,
    OUTPUT_PIN_RPA4 = 4,
    OUTPUT_PIN_RPA7 = 7,
    OUTPUT_PIN_RPA8 = 8,
    OUTPUT_PIN_RPA11 = 11,
    OUTPUT_PIN_RPA14 = 14,
    OUTPUT_PIN_RPA15 = 15,
    OUTPUT_PIN_RPB0 = 16,
    OUTPUT_PIN_RPB1 = 17,
    OUTPUT_PIN_RPB2 = 18,
    OUTPUT_PIN_RPB3 = 19,
    OUTPUT_PIN_RPB4 = 20,
    OUTPUT_PIN_RPB5 = 21,
    OUTPUT_PIN_RPB6 = 22,
    OUTPUT_PIN_RPB7 = 23,
    OUTPUT_PIN_RPB9 = 25,
    OUTPUT_PIN_RPB10 = 26,
    OUTPUT_PIN_RPB11 = 27,
    OUTPUT_PIN_RPB13 = 29,
    OUTPUT_PIN_RPB14 = 30,
    OUTPUT_PIN_RPB15 = 31,
    OUTPUT_PIN_RPC0 = 32,
    OUTPUT_PIN_RPC1 = 33,
    OUTPUT_PIN_RPC2 = 34,
    OUTPUT_PIN_RPC4 = 36,
    OUTPUT_PIN_RPC6 = 38,
    OUTPUT_PIN_RPC7 = 39,
    OUTPUT_PIN_RPC8 = 40,
    OUTPUT_PIN_RPC9 = 41,
    OUTPUT_PIN_RPD3 = 51,
    OUTPUT_PIN_RPD4 = 52,
    OUTPUT_PIN_RPD5 = 53,
    OUTPUT_PIN_RPD6 = 54,
    OUTPUT_PIN_RPF0 = 80,
    OUTPUT_PIN_RPF1 = 81,
    OUTPUT_PIN_RPG0 = 96,
    OUTPUT_PIN_RPG1 = 97,
    OUTPUT_PIN_RPG6 = 102,
    OUTPUT_PIN_RPG7 = 103,
    OUTPUT_PIN_RPG8 = 104,
    OUTPUT_PIN_RPG9 = 105,
    OUTPUT_PIN_RPA12 = 12,
    OUTPUT_PIN_RPB12 = 28,
    OUTPUT_PIN_RPC10 = 42,
    OUTPUT_PIN_RPC12 = 44,
    OUTPUT_PIN_RPC15 = 47,
    OUTPUT_PIN_RPE0 = 64,
    OUTPUT_PIN_RPE1 = 65,
    OUTPUT_PIN_RPE14 = 78,
    OUTPUT_PIN_RPE15 = 79,
    OUTPUT_PIN_RPG12 = 108

} PORTS_REMAP_OUTPUT_PIN;

typedef enum {

    PORT_CHANNEL_A = 0x00,
    PORT_CHANNEL_B = 0x01,
    PORT_CHANNEL_C = 0x02,
    PORT_CHANNEL_D = 0x03,
    PORT_CHANNEL_E = 0x04,
    PORT_CHANNEL_F = 0x05,
    PORT_CHANNEL_G = 0x06

} PORTS_CHANNEL;

typedef enum {

    PORTS_CHANGE_NOTICE_EDGE_RISING = 0,
    PORTS_CHANGE_NOTICE_EDGE_FALLING = 1

} PORTS_CHANGE_NOTICE_EDGE;

typedef enum {

    PORTS_PIN_SLEW_RATE_FASTEST = 0x05,
    PORTS_PIN_SLEW_RATE_FAST = 0x06,
    PORTS_PIN_SLEW_RATE_SLOW = 0x09,
    PORTS_PIN_SLEW_RATE_SLOWEST = 0x0A

} PORTS_PIN_SLEW_RATE;

typedef enum {

    PORTS_CHANGE_NOTICE_METHOD_SAMPLED = 0,
    PORTS_CHANGE_NOTICE_METHOD_EDGE_DETECT = 1

} PORTS_CHANGE_NOTICE_METHOD;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/ports_RemapInput_default.h"
#include "../templates/ports_RemapOutput_PIC32_2.h"
#include "../templates/ports_PinMode_PPS.h"
#include "../templates/ports_AnPinsMode_Unsupported.h"
#include "../templates/ports_PortsRead_MCU32_PPS.h"
#include "../templates/ports_LatchRead_MCU32_PPS.h"
#include "../templates/ports_PortsWrite_MCU32_PPS.h"
#include "../templates/ports_PortsDirection_MCU32_PPS.h"
#include "../templates/ports_PortsOpenDrain_MCU32_PPS.h"
#include "../templates/ports_ChangeNotice_Unsupported.h"
#include "../templates/ports_PinChangeNotice_Unsupported.h"
#include "../templates/ports_ChangeNoticeInIdle_Unsupported.h"
#include "../templates/ports_ChangeNoticePullup_Unsupported.h"
#include "../templates/ports_PinModePerPort_Default.h"
#include "../templates/ports_ChangeNoticePullDownPerPort_Default.h"
#include "../templates/ports_ChangeNoticePullUpPerPort_Default.h"
#include "../templates/ports_PinChangeNoticePerPort_Default.h"
#include "../templates/ports_ChangeNoticePerPortTurnOn_Default.h"
#include "../templates/ports_ChangeNoticeInIdlePerPort_Unsupported.h"
#include "../templates/ports_ChangeNoticePerPortStatus_Default.h"
#include "../templates/ports_SlewRateControl_Default.h"
#include "../templates/ports_ChannelChangeNoticeMethod_Default.h"
#include "../templates/ports_ChangeNoticeEdgeControl_Default.h"
#include "../templates/ports_ChangeNoticeEdgeStatus_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_PORTS_RemapInput(PORTS_MODULE_ID index, PORTS_REMAP_INPUT_FUNCTION inputFunction, PORTS_REMAP_INPUT_PIN remapInputPin)
{
     PORTS_RemapInput_default(index, inputFunction, remapInputPin);
}

PLIB_INLINE_API bool PLIB_PORTS_ExistsRemapInput(PORTS_MODULE_ID index)
{
     return PORTS_ExistsRemapInput_default(index);
}

PLIB_INLINE_API void PLIB_PORTS_RemapOutput(PORTS_MODULE_ID index, PORTS_REMAP_OUTPUT_FUNCTION outputFunction, PORTS_REMAP_OUTPUT_PIN remapOutputPin)
{
     PORTS_RemapOutput_PIC32_2(index, outputFunction, remapOutputPin);
}

PLIB_INLINE_API bool PLIB_PORTS_ExistsRemapOutput(PORTS_MODULE_ID index)
{
     return PORTS_ExistsRemapOutput_PIC32_2(index);
}

PLIB_INLINE_API void PLIB_PORTS_PinModeSelect(PORTS_MODULE_ID index, PORTS_ANALOG_PIN pin, PORTS_PIN_MODE mode)
{
     PORTS_PinModeSelect_PPS(index, pin, mode);
}

PLIB_INLINE_API bool PLIB_PORTS_ExistsPinMode(PORTS_MODULE_ID index)
{
     return PORTS_ExistsPinMode_PPS(index);
}

